I'll continue the story from where it left off:

Alice lifted the next file—thick, stapled crooked—and spread it flat. Pages fanned like a deck someone had dropped. Each showed a schedule: parade posts, radio slots, who stood where when the brass marched. She touched a name inked in the corner of a manifest. Miguel de la Cruz. The handwriting matched the signature on a loan order for hospital staff. It matched the approval for radio volunteers. It looped in the same indulgent way on three different papers separated by months.

"Here," she said. She pushed the page toward Terry. Her fingernail underlined the name. "Same hand. Same flourish on the 'g.' He signs like he's writing love letters to himself."

Terry's mouth did something that wasn't quite a smile. "And he's scheduled for the reviewing stand. Second row. Near enough to wave, far enough to duck."

The recording clicked off. The voice hung in the air for a beat, then dissolved into fan noise and river hush. Lumen's screen shifted—the wave form collapsed into a signature, a thumbprint of sound. Numbers appeared beneath it: percentages, correlations, the math of matching one lie to another.

"Confidence is high," Lumen said. "The voice on your recording shares cadence markers with parade post transmissions. The 'patriotic patience' phrase appears three times in ministry memos this month. Always near his signature."

Alice stood and moved to the veranda rail. The wood was slick with humidity. She pressed her palms flat and leaned out, looking down at the steps where boats bumped the small dock. A boy sat with a fishing line, patient as stone. The heat made her collar stick to her neck.

"Marisol comes at noon," she said without turning. "She'll know the voice. She's heard it on stairs, through doors. She knows who wears too much cologne on radio days."

Terry gathered the papers into a stack, edges aligned. He had the movements of someone who'd organized evidence before, who knew that presentation mattered as much as proof. "We need him to speak where others hear," he said. "Not in an office. Not where he controls the walls."

"The parade," Alice said. She turned, hip against the rail. "All those flags. All those witnesses who think they're watching something else."

The tablet pulsed. Lumen's voice took on a quality that meant it was pulling from multiple sources at once. "The reviewing stand has an open radio post for emergencies. It broadcasts to the parade route. If someone were to... adjust the frequency during a speech—"

"We'd pipe him to everyone," Terry finished. He looked at Alice. "Including the camps."

Alice moved back to the table and sat. The chair creaked—a familiar complaint. She pulled the hospital admissions toward her again, scanning the entries from overnight. Foreign male, hypothermic, delirium. Kessler's hand had been so cold when she'd touched it, like the river had tried to keep him.

"He said Peter was shot," she said. The words came flat, factual. She'd already cried in the bathroom at the hospital, quick and silent, water running to hide the sound. Now she was past that, into something harder. "One shot. Before dawn."

Terry's jaw tightened. "He said he heard one shot. Rivers lie."

"Rivers echo," Alice corrected. "Men lie."

Outside, someone laughed—a short burst from the lane. A motorcycle coughed to life and complained its way toward the avenue. The drums were warming up there, she could hear them even at this distance. The sound made her teeth ache.

"If Peter's alive," she said, and she refused to let the if do what it wanted to her voice, "they'll move him during the parade. Everyone watching flags, no one watching roads."

"The camps thin when the city gets loud," Terry agreed. He traced a tributary on the map with one finger, not touching the paper. "Guards go to bridges to feel important. The smart ones stay back and move cargo."

Lumen's screen brightened. "I've been monitoring ELT frequencies," it said. "There's chatter about 'merchandise.' They're using code, but the pattern suggests movement. Time stamps align with parade rehearsal."

Alice reached for the red-button recorder and rewound it. The voice came again—that bureaucratic glide, the smile you could hear. She'd stood in his office once, before she knew what he was. He'd offered her coffee and sympathy and paperwork that went nowhere. His tie had been perfect. His plants on the windowsill had been dying.

"When Marisol identifies him," she said, "we need more than her word."

"We need him to say something he can't take back," Terry said. He pulled out a cigarette he wouldn't smoke, turned it in his fingers. "Something that ties him to both sides of the radio."

The fan ticked. The river pushed. Alice lifted the tablet and angled it so the light caught her face from below. She looked older in that light, or maybe just more certain.

"Lumen," she said, "can you map probable movement patterns if the camps shift during the parade?"

"Already mapping," Lumen replied. The screen filled with lines—possible routes from the ELT camps to the city, from the city to the border. They branched like veins. One line pulsed brighter. "This path keeps appearing in correlations. It passes under the pipeline crossing. Guards there will be watching the parade on portable radios."

"Distracted," Terry said.

"Complicit," Alice corrected again.

She stood and walked to the corner where they'd hung the engineer's jacket Peter had left. It smelled like him—coffee, machine oil, the particular soap he used that came in a blue wrapper. She touched the collar, then let her hand drop.

"We go to the avenue," she said. "We stand where he has to see us. Where everyone has to see us see him."

Terry rose, chair legs scraping. "You know what that costs if we're wrong?"

"Same as if we're right," Alice said. She turned to face him. Her eyes were dry, focused. "A scene. Questions. Maybe deportation. Maybe worse."

"Definitely worse," Terry said. But he was already moving toward his jacket.

The tablet dimmed, then brightened again. Lumen's voice came gentle but firm, the way a friend tells you a hard truth. "The window opens in three hours," it said. "Whatever you're going to do, the sky agrees with doing it then."

Alice picked up the stack of papers, tapped them straight. The names and dates aligned into a kind of weapon. Outside, the drums found their rhythm. The city was dressing itself in flags.

She looked at Terry. He looked back. Neither smiled. This wasn't that kind of moment.

"After the parade," she said, making it a promise.

"No independent deals," he answered, making it a lock.

They gathered their things—papers, recordings, the tablet with its breathing light. The fan continued its patient work above them. The river below kept its own time, indifferent to parades and prayers and the particular grief of not knowing.

As they left, Alice paused in the doorway. She looked back at the veranda, at the table with its water rings and coffee stains, at the map where Peter's pencil marks still showed. She'd sat there so many mornings, planning routes that went where they were supposed to. Now she was planning a route through a parade, to a man who thought his smile was armor.

"Ready?" Terry asked.

She wasn't. She went anyway.

The noon sun had turned Avenida de la Patria into a bright river of its own. Flags hung limp as tongues. The brass band sweated through "Marcha de la Victoria" for the third time while children in white shirts wilted against their mothers. The reviewing stand rose in tiers—pressed wood painted to look like marble, bunting that had seen better years. At the radio post, a young man in a too-large uniform adjusted dials with nervous precision.

Alice stood at the corner where the avenue met Calle Comercio. The papers in her bag had gained weight in the heat. Beside her, Terry watched the crowd with the kind of attention that made him invisible—just another foreign contractor trying to understand local enthusiasm.

"There," Terry said, barely moving his mouth.

Miguel de la Cruz stood in the second row of the reviewing stand, hands clasped behind him. His hair caught the light—still wet from whatever he used to make it behave. He wore a white shirt that looked cool despite the heat, pressed lines that would stay sharp until evening. When he smiled at the mayor's wife, his teeth were very white.

Alice felt her pulse in her throat. She made it slow down by counting the brass players. Twelve. She counted the drums. Eight. She counted the steps from where she stood to the reviewing stand. Forty-three.

"And there," Terry added.

Marisol emerged from the ministry door across the avenue, basket balanced on her hip. She'd changed from her work clothes into a dress—blue, simple, the kind you wore when you wanted to look like you belonged at a celebration. She saw Alice and didn't wave, just lifted her chin in acknowledgment. She began working her way through the crowd, the basket giving her passage.

The tablet in Alice's bag vibrated once. She pulled it out enough to see Lumen's message: Window opening. Signal clarifying. Ten minutes.

A the drums rolled into something that wanted to be grand. The crowd pressed forward. Miguel stepped to the podium microphone, hands easy on the edges. The young radio operator scrambled to adjust levels.

Miguel began to speak. His voice had that same quality—silk over gravel, warmth that wasn't warm. "Citizens of San Aurelio, today we celebrate..." The words poured out like syrup. Alice had heard this voice in the dark, through rain, pretending to be a rebel.

Marisol reached them, breathing hard. She set the basket down and looked at the reviewing stand. Her face didn't change, but her knuckles went white where she gripped her skirt.

"Es él," she said quietly. "That's him. I've heard him practice in the ministry bathroom. Same voice on the stairs when he thinks no one's listening."

Terry pulled out his phone, thumbed to record. "Say it again. Your name first."

Marisol looked at him, then at Alice. She understood what they were asking. She wet her lips and spoke clearly: "My name is Marisol Herrera. I clean the ministry offices. That man—Miguel de la Cruz—his voice is the same as the ELT negotiator on the rebel frequency. I've heard both. Es la misma voz."

The recording saved. Terry pocketed the phone. "Thank you," he said.

On the stand, Miguel continued his speech. "...the strength of our nation, the security of our people..." His hand rose for emphasis. The radio carried his words down the avenue, into shops, into homes where televisions were dark but radios never slept.

Alice pulled out her tablet fully now. Lumen's interface was bright despite the sun. "Can you patch into the radio post?" she asked quietly.

"Already in," Lumen replied. "The frequency is open. But once I bridge it to the ELT channel, everyone listening to either will hear both."

"Good," Alice said.

She began walking toward the reviewing stand. Terry followed, then Marisol. The crowd parted reluctantly. Alice held the papers—all of them, the hospital records, the signatures, the schedules where Miguel had written himself into both sides of the war.

Miguel saw her when she was twenty steps away. His voice didn't falter, but something in his eyes shifted. He knew her. He remembered the coffee, the sympathy, the papers that went nowhere.

"...and so we must remain vigilant," he was saying. "Against those who would divide us."

Ten steps. The young radio operator looked nervous. The mayor's wife smiled vaguely. The drums had stopped.

Five steps. Alice climbed the reviewing stand stairs. No one stopped her—she moved like she belonged, like she had urgent business. Terry stayed at the base, hand casual near his pocket.

Miguel's voice finally caught. "...and we must..." He looked at Alice directly now. She stood three feet from the podium, papers visible in her hands.

"Señor de la Cruz," she said. Her voice was steady, clear. The microphone caught it. "I have a question about your radio work."

His smile tried to hold. "Señora, this is not—"

"Your signature," she continued, lifting the first page where everyone could see. "On hospital transfers. On radio post assignments. The same signature. The same hand that writes 'Verde' in the camp communications."

The crowd had gone quiet. Even the children stopped squirming.

Miguel's face was very still. "These are serious accusations with no—"

"Your voice," Alice said. She pulled out her recorder, held it high, pressed play. Miguel's voice filled the avenue—but not from the podium. From the recorder: "Patience, patience. After the parade, we discuss terms."

Then Lumen did it. The bridge opened. The radio post frequency merged with the ELT channel. Suddenly, Miguel's voice was everywhere, doubled, tripled—from the podium, from the recorder, and from every radio tuned to either frequency:

"This is not—" from the podium.

"Verde confirms, no independent deals—" from the ELT channel.

"Citizens must understand—" from the podium.

"Keep them until after the parade—" from the ELT channel.

The two voices, same timbre, same careful consonants, same smile, braided together into something undeniable.

Miguel's hand went to the radio operator, trying to make him cut the feed. But Lumen had locked it. Every word he spoke now went everywhere. The camps would hear it. The city would hear it. His mother would hear it.

"Turn it off," he said, forgetting the microphone was live. "Turn it—"

"I can't," the operator said, also live to the city. "It's not—the system is—"

Terry climbed the stairs, phone out, recording everything. Marisol followed. Others in the crowd had phones out now too.

Miguel's carefully constructed face finally broke. The smile fell off like paint in rain. Underneath was something cornered and ordinary.

"You need to understand," he said, and everyone heard it. "This is complex. There are arrangements. The camps need—we need to manage—"

"You need to manage both sides to keep your desk," Alice said. She was close enough to smell his cologne now. It was expensive, wrong for the heat. "You coordinate with ELT. You delay negotiations. You know where prisoners are."

"This is not—" He stopped. Understood that everything he said now was evidence. His shoulders dropped.

The mayor's wife stepped back from him. The radio operator stood and moved away. The crowd below had doubled—people drawn by the spectacle of someone important becoming ordinary in public.

Alice leaned into the microphone. "My husband was taken on the pipeline route. You knew. You delayed. You coordinated." She kept her voice level. This wasn't about her grief. This was about making it impossible for him to return to his office, to his radio, to his careful game.

Miguel looked at her. For a moment, the performance dropped entirely. "They were supposed to wait," he said quietly. But the microphone caught it. The city heard it. "After the parade. That was the agreement."

The admission hung in the air like a flag with no wind.

Terry stepped forward. "Where are the camps now?"

Miguel's mouth opened, closed. He looked at the crowd, at the cameras, at the avenue where drums had gone silent. "I want a lawyer," he said.

"You want a lot of things," Alice said. She set the papers on the podium—all of them, the whole story in signatures and dates. "Where are the camps?"

Police were moving through the crowd now, but uncertain. Was this an arrest? A scene? A performance? The reviewing stand had become a stage no one had rehearsed for.

Miguel's gaze went to the river visible between buildings. "They move during the noise," he said, defeated. "Today. The pipeline crossing. While everyone watches flags."

Alice felt something in her chest crack and seal at the same time. She turned to Terry, then to Lumen's bright screen.

"Pipeline crossing," she said. "Now."

Lumen's reply was instant: "Calling Dino. Route mapped. The window is open for seven more minutes."

Miguel tried to move toward the stairs. The mayor's wife blocked him without seeming to mean to. The radio operator had found the volume and turned it up. Every word, every breath, went out to the city and the camps and the places between.

Alice looked at Miguel one more time. His white shirt had dark patches now. His perfect hair had loosened. He looked like what he was—a middle manager who'd tried to play war like a clerk game.

"The shot," she said quietly, just for him. But the microphone took that too. "The single shot. Was it real?"

His eyes flickered. "I don't—they don't always tell me. Sometimes they perform for the radio. Sometimes..." He stopped.

"Sometimes what?"

"Sometimes they just move inventory," he said. The words were ugly in the daylight.

Alice turned away. She'd gotten what she came for—not certainty, but enough doubt to hope. She descended the stairs, Terry beside her, Marisol behind. The crowd parted. Some clapped, thinking they'd seen a show. Others understood they'd seen something else—a small war played out in papers and voices.

The avenue stretched ahead. Somewhere, a helicopter was starting its engines. Somewhere, camps were moving through jungle, thinking the parade covered them. Somewhere, maybe, Peter was alive, was moving, was counting.

The drums started again, uncertain. The parade wanted to continue but didn't know how. The flag bearers looked at each other, waiting for someone to make a decision.

Alice kept walking. Behind her, Miguel's voice still carried from the podium—now others were questioning him, the mayor, a reporter who'd appeared from nowhere. His answers went out on every frequency, into every corner where someone had thought the bureaucracy would protect them.

"The pipeline," Terry said, matching her pace.

"The crossing," she agreed.

They moved through the city that was still dressed for celebration, toward the river, toward the camps that thought they were hidden by drums and distance. The papers had done their work. Now came the harder part—finding what the papers had hidden.

Lumen's screen showed a helicopter icon moving across the map, a small bright dot against the green.

Seven minutes. The window was open. The city had heard the truth. Now they had to make that truth matter before the sky changed its mind.
